---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelModel
source: html/c024017d-71e4-1b4c-d463-64fdf67c6a79.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelModel Property

"Model"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelModel { get; }
```